a = [1,2,3]

# 특정 위치의 요소를 교체(배열 통째로 들어감 like append)
a[1] = ['a','b','c']

print(a)

print(a[0])
print(a[1])
print(a[1][0])
print('-' * 30)

b = [1,2,3,4,5]
b[1:3] = [1000]
print(b)

# 슬라이싱 : 지정한 범위의 요소를 제거하고 새로운 요소를 넣음 (요소들이 들어감 like extend)
b[1:2] = ['a', 'b', 'c']
b[1:2] = [['a', 'b', 'c']] # 리스트로 넣고 싶으면 한번 더 감싸주면 됨
print(b)

# 리스트로 오늘의 명언 10개 넣기. 그 중 랜덤으로 하나 출력
list = ["참으로 진지한 철학적 문제는 오직 하나뿐이다. 그것은 바로 자살이다."
        , "이 세상 자체는 합리적이지 않다. ... 부조리한 것은 이 비합리적인 것과 인간의 마음속에서 울려 퍼지는 명확성에 대한 간절한 갈망의 대결이다."
        , "나는 부조리에서 세 가지 귀결을 이끌어낸다. 그것은 바로 나의 반항, 나의 자유, 그리고 나의 열정이다."
        , "중요한 것은 죽더라도 화해하지 않고 죽는 것이지 기꺼이 받아들이면서 죽는 것은 아니다."
        , "산꼭대기를 향한 투쟁만으로도 인간의 마음을 채우기에 충분하다; 우리는 시지프가 행복하다고 상상하여야 한다."
        , "삶에 대한 절망 없이는 삶에 대한 사랑이 없다.", "인간의 상태를 경멸하는 자는 겁쟁이지만, 희망을 가진 자는 바보다."
        , "겨울의 깊이에 나는 마침내 내 안에 무적의 여름이 있다는 것을 알게 되었다."
        , "반란군이란 무엇인가? 싫다고는 하지만 거절이 포기를 의미하지는 않는 사람이다."
        , "부조리를 물리칠 수 있는 유일한 것은 명석함뿐이기 때문이다."
]
import random
while True:
    user = input('...')
    if user.lower() == 'x':
        break
    index = random.randint(1,9)
    print(f'오늘의 명언 : {list[index]}')