'''
* 모듈 : 파이썬 코드가 저장된 하나의 파일
        관련된 변수, 함수, 클래스 ... 모두 넣을 수 있음
    
* 클래스 : 변수, 메서드를 넣을 수 있음. 객체를 생성하여 사용



구분         모듈(module)                            클래스(Class)
------------------------------------------------------------------------------------
정의 기준      하나의 파일                              파일 내부의 코드 블록(class...)
인스턴스화     불가능(자체로 사용)                       가능
주요 목적      관련함수/변수를 파일단위로 정리 및 재사용    데이터와 기능을 묶어 여러 객체 생성
객체지향 가능   상속, 다형성등 사용불가                   상속, 다형성, 캡슐화 사용가능
'''
# 모듈 사용법 1
import my_module1
my_module1.my_func()

# 모듈 사용법 2 - 별칭 사용하기
import my_module1 as m
m.my_func()

# 모듈 사용법 3 - 함수 / 클래스 읽어오기
from my_module1 import my_func
my_func()

# 모듈 사용법 4 - 함수 / 클래스 as 별칭
from my_module1 import my_func as mf
mf()


