print(1,3,5)
print('아무개씨','안녕하세요')
print('-'*20)
# 구분자 + 는 문자열 일때는 연결하여 출력(띄어쓰기 안함)
print(1+3+5)
print('아무개씨'+'안녕하세요')
print('-'*20)

# print(1+'홍길동')
print(1,'홍길동')
print(str(1)+' 홍길동')
print('-'*20)

# 서식출력 %d, %f, %c, %s
print("정수 : %d, 실수 : %f, 문자열 : %s" %(5,3.14,'홍길동'))
print('-'*20)

# 자리지정 %자리수d(정수)
print("정수 5칸 : %5d, 실수 총 5칸 소수점 아래 2칸 : %5.2f, 문자열 5칸 : %5s, 문자열 2칸 : %2s" %(5,3.14,'홍길동','홍길동'))
print("실수 소수점 2째 자리까지만 출력 : %.2f, %.2f, %.2f" %(12.4124, 135, 4.1231512))
print('-'*20)

# sep 속성 - 분리 문자 설정, 기본값은 공백 문자
print(5, 7.7, '더조은', True)
print(5, 7.7, '더조은', True, sep=',')
print(5, 7.7, '더조은', True, sep=' , ')
print(5, 7.7, '더조은', True, sep=' / ')
print('-'*20)

# 개행문자, end 속성
print('오늘은\t수요일\n공부하는 날')
print('오늘은', end=' ')
print('수요일', end='\t')
print('공부하는 날', end='\n')
print('-'*20)

# 포맷
print('이름 : {}, 나이 : {}, 성별 : {}'.format('홍길동',20,'남자'))
print('{2}, {1}, {0}'.format(1,2,3))
print(format(3.141592,'.2f'))
print('원주율 :',format(3.141592,'.2f'))
print('금액 :',format(500,'7d'))
print('금액 :',format(2000,'7d'))
print('금액 :',format(3985000,'3,d'))
print('-'*20)

# f스트링
print('두 수의 합은', 3+5, '입니다')
print(f'두 수의 합은 {3+5}입니다')

